tests/eval_contained/mutants/M17_credentials_forwarded.patch
# Mutant M17_credentials_forwarded — must be caught by C1
# Addition beyond the eval plan's table. Forwarding credential prefixes puts live API keys into the sandbox argv and into any dry-run output or retained evidence file. Restoring the ANTHROPIC_ prefix also lets a host ANTHROPIC_VERTEX_PROJECT_ID through, which C1 must catch.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/cli/_run_args.py
+++ b/factory/cli/_run_args.py
@@ -83,7 +83,7 @@
 # controls below: dry-run is a decision about *this* invocation, and forwarding it would put the
 # sandboxed factory into dry-run too.
 SANDBOX_ENV_POLICY = EnvPolicy(
-    forward_prefixes=("FACTORY_",),
+    forward_prefixes=("FACTORY_", "ANTHROPIC_", "OPENAI_", "CODEX_"),
     drop_prefixes=("FACTORY_EVAL_",),
     drop_keys=(SANDBOX_DRY_RUN_ENV,),
     substitutions=(
