tests/eval_contained/mutants/M11_growth_absence_is_fatal.patch
# Mutant M11_growth_absence_is_fatal — must be caught by C24
# Eval plan §6 M11. Turning a comparability caveat into a non-zero exit converts a warning into an outage; C24 exists to pin the exit code at 0.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/cli/contained.py
+++ b/factory/cli/contained.py
@@ -719,6 +719,7 @@
     # "your numbers are not comparable" problem, not a "this cannot run" problem.
     for warning in plan.warnings:
         print(f"Warning: {warning}", file=sys.stderr)
+        return 1
 
     if build_pod is not None:
         for finding in audit_pod(build_pod):
