tests/eval_contained/mutants/M14_bare_unconditional.patch
# Mutant M14_bare_unconditional — must be caught by C4
# Addition beyond the eval plan's table, which has no mutant for C4. C4 exists to keep the runner change scoped; unscoped, --bare changes every invocation on a developer's machine, and C3 alone cannot tell the two apart.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/runners/claude.py
+++ b/factory/runners/claude.py
@@ -144,7 +144,7 @@
             "--disallowedTools",
             "Agent",
         ]
-        if in_sandbox():
+        if True:  # MUTANT
             # Inside an OpenShell sandbox there is no browser and no way to complete an OAuth
             # login, so Claude Code must be told not to try. Scoped to sandbox mode: adding it
             # unconditionally would change every ordinary invocation on a developer's machine.
