tests/eval_contained/mutants/M18_pod_patch_replaces_containers.patch
# Mutant M18_pod_patch_replaces_containers — must be caught by C13
# Addition beyond the eval plan's table, which has no mutant for C13. Replacing lists instead of merging them makes a one-field patch silently discard the container's image, command, and security context — C11 and C12 would then be vacuously true because the fields they check no longer exist.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -689,7 +689,7 @@
         if isinstance(base_value, dict) and isinstance(patch_value, dict):
             result[key] = strategic_merge(base_value, patch_value)
         elif isinstance(base_value, list) and isinstance(patch_value, list):
-            result[key] = _merge_named_list(base_value, patch_value)
+            result[key] = copy.deepcopy(patch_value)  # MUTANT
         else:
             result[key] = copy.deepcopy(patch_value)
     return result
