tests/eval_contained/mutants/M15_tmux_argv_drift.patch
# Mutant M15_tmux_argv_drift — must be caught by C21
# Addition beyond the eval plan's table, which has no mutant for C21. The arg-builder extraction is a pure refactor whose only guard is byte-identity; a probe that cannot see a one-flag drift would let the refactor silently change what `factory tmux` runs.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/cli/_run_args.py
+++ b/factory/cli/_run_args.py
@@ -152,7 +152,7 @@
     if model:
         parts.append(f"--model {shlex.quote(model)}")
     if getattr(args, "no_github", False):
-        parts.append("--no-github")
+        parts.append("--no-gh")
     if getattr(args, "profile", None):
         parts.append(f"--profile {shlex.quote(args.profile)}")
     if getattr(args, "focus", None):
