tests/eval_contained/mutants/M19_privileged_override_silent.patch
# Mutant M19_privileged_override_silent — must be caught by C14
# Addition beyond the eval plan's table, which has no mutant for C14. `--pod-manifest` is an explicit override, so it must be honoured — but honouring it silently means an operator can widen the privilege budget without anything saying so.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -663,8 +663,7 @@
     """
     findings: list[str] = []
     blob = yaml.safe_dump(manifest)
-    if "privileged: true" in blob:
-        findings.append("privileged: true is set")
+    # MUTANT: privileged overrides are accepted silently
     if "SYS_ADMIN" in blob:
         findings.append("SYS_ADMIN capability is requested")
     if "hostPath" in blob:
