tests/eval_contained/mutants/M16_tmux_persist_rejected_late.patch
# Mutant M16_tmux_persist_rejected_late — must be caught by C22
# Addition beyond the eval plan's table, which has no mutant for C22. Accepting the flag at parse time and failing later is the exact defect C22 forbids, and an exit-code-only check cannot tell the two apart.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/cli/contained.py
+++ b/factory/cli/contained.py
@@ -146,7 +146,7 @@
         dest="extra_env",
         help="Extra environment variable for the sandbox. Repeatable. Applied after the env policy.",
     )
-    p.add_argument("--tmux-persist", action=_RejectTmuxPersist, help=argparse.SUPPRESS)
+    p.add_argument("--tmux-persist", action="store_true", default=False, help=argparse.SUPPRESS)
 
     # The `factory ceo` flags that are re-serialized into the in-sandbox invocation.
     p.add_argument("--mode", default="auto", help="Run mode passed through to the CEO")
