tests/eval_contained/mutants/M2_drop_bare.patch
# Mutant M2_drop_bare — must be caught by C3
# Eval plan §6 M2. Without --bare, Claude Code attempts its OAuth login flow inside the sandbox and every agent turn hangs or fails on a prompt nothing can answer.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/runners/claude.py
+++ b/factory/runners/claude.py
@@ -144,11 +144,6 @@
             "--disallowedTools",
             "Agent",
         ]
-        if in_sandbox():
-            # Inside an OpenShell sandbox there is no browser and no way to complete an OAuth
-            # login, so Claude Code must be told not to try. Scoped to sandbox mode: adding it
-            # unconditionally would change every ordinary invocation on a developer's machine.
-            cmd.append("--bare")
         cmd.extend(_mcp_config_flags(request.cwd))
         settings_file = request.extras.get("settings_file")
         if settings_file:
