tests/eval_contained/mutants/M4_factory_state_respects_gitignore.patch
# Mutant M4_factory_state_respects_gitignore — must be caught by C5
# Eval plan §6 M4. Transferring .factory/ without disabling .gitignore filtering drops config.json, eval_profile.json, and results.tsv, and the factory boots into a fresh-project state without erroring.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/cli/contained.py
+++ b/factory/cli/contained.py
@@ -528,7 +528,7 @@
             Upload(
                 local=factory_dir,
                 dest=sbx_path,
-                respect_gitignore=False,
+                respect_gitignore=True,
                 description="experiment state (.gitignore filtering disabled)",
             )
         )
