tests/eval_contained/mutants/M3_base_url_v1_suffix.patch
# Mutant M3_base_url_v1_suffix — must be caught by C2
# Eval plan §6 M3. Claude Code appends /v1/messages itself, so a /v1 suffix produces /v1/v1/messages — a 404 that looks like a gateway problem.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/sandbox.py
+++ b/factory/sandbox.py
@@ -18,7 +18,7 @@
 # Claude Code inside a sandbox talks to the OpenShell gateway's inference proxy in Anthropic-API
 # mode. No `/v1` suffix — Claude Code appends `/v1/messages` itself, and a doubled path fails in a
 # way that looks like a network policy problem rather than a configuration one.
-SANDBOX_INFERENCE_BASE_URL = "https://inference.local"
+SANDBOX_INFERENCE_BASE_URL = "https://inference.local/v1"
 
 # The proxy strips this and substitutes the real credential; it never reaches upstream. Claude Code
 # only needs *something* here to skip its OAuth login flow.
