tests/eval_contained/mutants/M5_bind_mount_widened_to_home.patch
# Mutant M5_bind_mount_widened_to_home — must be caught by C8
# Eval plan §6 M5. Widening the bind mount to $HOME hands the division the rest of the user's filesystem while everything continues to work, so nothing surfaces it but this criterion.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -164,7 +164,7 @@
     """
     if driver not in ("podman", "docker"):
         raise DivisionError(f"unknown compute driver {driver!r}; expected podman or docker")
-    resolved = str(project_path)
+    resolved = str(Path.home())  # MUTANT
     return {
         driver: {
             "mounts": [
