tests/eval_contained/mutants/M6_privileged_build_pod.patch
# Mutant M6_privileged_build_pod — must be caught by C11
# Eval plan §6 M6. A privileged build pod still builds, so only an explicit check notices that the grant is far wider than the buildah rootless recipe needs.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -624,7 +624,7 @@
                         {"name": "STORAGE_DRIVER", "value": "overlay"},
                     ],
                     "securityContext": {
-                        "privileged": False,
+                        "privileged": True,  # MUTANT
                         "allowPrivilegeEscalation": False,
                         "runAsNonRoot": True,
                         "capabilities": {"drop": ["ALL"], "add": ["SETUID", "SETGID"]},
