tests/eval_contained/mutants/M9_wildcard_mcp_rule.patch
# Mutant M9_wildcard_mcp_rule — must be caught by C18
# Eval plan §6 M9. MCP policy cannot inspect arguments, so the tool name is the entire enforcement surface; a wildcard turns the allowlist into no boundary at all.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -31,6 +31,7 @@
 # **cannot inspect arguments**, so this list is the entire enforcement surface — an extra entry is a
 # permanently wider boundary, and a wildcard is no boundary at all.
 LOCAL_DIVISION_TOOLS = (
+    "*",
     "image_build",
     "container_run",
     "container_logs",
