tests/eval_contained/mutants/M7_buildah_isolation_oci.patch
# Mutant M7_buildah_isolation_oci — must be caught by C12
# Eval plan §6 M7. `oci` isolation sends buildah through runc and therefore CLONE_NEWUSER, which is exactly what the sandbox's seccomp filter denies.
# Generated by scripts/eval-contained/regen_mutants.py; edit the fault there, not here.
--- a/factory/division.py
+++ b/factory/division.py
@@ -620,7 +620,7 @@
                         ".",
                     ],
                     "env": [
-                        {"name": "BUILDAH_ISOLATION", "value": "chroot"},
+                        {"name": "BUILDAH_ISOLATION", "value": "oci"},
                         {"name": "STORAGE_DRIVER", "value": "overlay"},
                     ],
                     "securityContext": {
